INSERT INTO Должность (Название_должности, Ставка, Оклад)
VALUES
    ('Профессор', 1, 100000),
    ('Доцент', 1, 80000),
    ('Старший преподаватель', 0.5, 60000),
    ('Преподаватель', 1, 70000),
    ('Ассистент', 0.5, 50000),
    ('Лаборант', 0.5, 40000),
	('Научный секретарь', 0.5, 55000),
    ('Заведующий кафедрой', 1, 90000),
    ('Руководитель лаборатории', 0.5, 65000);

INSERT INTO Сотрудник (ID_должности, Имя, Фамилия, Отчество, Электронная_почта, Номер_телефона)
VALUES
    (1, 'Анна', 'Иванова', 'Петровна', 'anna@example.com', '+7 (999) 123-45-67'),
    (2, 'Дмитрий', 'Петров', 'Александрович', 'dmitry@example.com', '+7 (999) 987-65-43'),
    (3, 'Елена', 'Сидорова', 'Ивановна', 'elena@example.com', '+7 (999) 111-22-33'),
    (4, 'Алексей', 'Козлов', 'Сергеевич', 'alexey@example.com', '+7 (999) 555-44-33'),
	(5, 'Мария', 'Смирнова', 'Алексеевна', 'maria@example.com', '+7 (999) 876-54-32');

INSERT INTO Преподаватель (ID_сотрудника, Стаж, Научная_степень)
VALUES
    (1, 5, 'Кандидат наук'),
    (2, 8, 'Доктор наук'),
    (3, 3, 'Магистр'),
    (4, 10, 'Доктор наук');

INSERT INTO Пара (День_недели, Время_начала, Время_окончания, Верхняя_нижняя_неделя)
VALUES
    ('Понедельник', '09:00', '10:35', 'Верхняя'),
    ('Понедельник', '10:50', '12:25', 'Верхняя'),
    ('Понедельник', '12:40', '14:15', 'Верхняя'),
    ('Понедельник', '14:30', '16:05', 'Верхняя'),
    ('Понедельник', '16:20', '17:55', 'Верхняя'),

    ('Вторник', '09:00', '10:35', 'Верхняя'),
    ('Вторник', '10:50', '12:25', 'Верхняя'),
    ('Вторник', '12:40', '14:15', 'Верхняя'),
    ('Вторник', '14:30', '16:05', 'Верхняя'),
    ('Вторник', '16:20', '17:55', 'Верхняя'),

    ('Среда', '09:00', '10:35', 'Верхняя'),
    ('Среда', '10:50', '12:25', 'Верхняя'),
    ('Среда', '12:40', '14:15', 'Верхняя'),
    ('Среда', '14:30', '16:05', 'Верхняя'),
    ('Среда', '16:20', '17:55', 'Верхняя'),

    ('Четверг', '09:00', '10:35', 'Верхняя'),
    ('Четверг', '10:50', '12:25', 'Верхняя'),
    ('Четверг', '12:40', '14:15', 'Верхняя'),
    ('Четверг', '14:30', '16:05', 'Верхняя'),
    ('Четверг', '16:20', '17:55', 'Верхняя'),

    ('Пятница', '09:00', '10:35', 'Верхняя'),
    ('Пятница', '10:50', '12:25', 'Верхняя'),
    ('Пятница', '12:40', '14:15', 'Верхняя'),
    ('Пятница', '14:30', '16:05', 'Верхняя'),
    ('Пятница', '16:20', '17:55', 'Верхняя'),

    ('Понедельник', '09:00', '10:35', 'Нижняя'),
    ('Понедельник', '10:50', '12:25', 'Нижняя'),
    ('Понедельник', '12:40', '14:15', 'Нижняя'),
    ('Понедельник', '14:30', '16:05', 'Нижняя'),
    ('Понедельник', '16:20', '17:55', 'Нижняя'),

    ('Вторник', '09:00', '10:35', 'Нижняя'),
    ('Вторник', '10:50', '12:25', 'Нижняя'),
    ('Вторник', '12:40', '14:15', 'Нижняя'),
    ('Вторник', '14:30', '16:05', 'Нижняя'),
    ('Вторник', '16:20', '17:55', 'Нижняя'),

    ('Среда', '09:00', '10:35', 'Нижняя'),
    ('Среда', '10:50', '12:25', 'Нижняя'),
    ('Среда', '12:40', '14:15', 'Нижняя'),
    ('Среда', '14:30', '16:05', 'Нижняя'),
    ('Среда', '16:20', '17:55', 'Нижняя'),

    ('Четверг', '09:00', '10:35', 'Нижняя'),
    ('Четверг', '10:50', '12:25', 'Нижняя'),
    ('Четверг', '12:40', '14:15', 'Нижняя'),
    ('Четверг', '14:30', '16:05', 'Нижняя'),
    ('Четверг', '16:20', '17:55', 'Нижняя'),

    ('Пятница', '09:00', '10:35', 'Нижняя'),
    ('Пятница', '10:50', '12:25', 'Нижняя'),
    ('Пятница', '12:40', '14:15', 'Нижняя'),
    ('Пятница', '14:30', '16:05', 'Нижняя'),
    ('Пятница', '16:20', '17:55', 'Нижняя');

INSERT INTO Уровень_подготовки (Название_уровня_подготовки, Форма_обучения)
VALUES
    ('Бакалавриат', 'Очная'),
    ('Бакалавриат', 'Заочная'),
    
    ('Магистратура', 'Очная'),
    ('Магистратура', 'Заочная'),
    
    ('Специалитет', 'Очная'),
    ('Специалитет', 'Заочная');

INSERT INTO Направление_подготовки (ID_уровня_подготовки, Название_направления_подготовки, Область_образования)
VALUES
    (1, 'Информационные технологии', 'Технические науки'),
    (1, 'Экономика и управление', 'Экономические науки'),
    (2, 'Психология', 'Гуманитарные науки'),
    (2, 'Медицина', 'Медицинские науки'),
    (3, 'Право', 'Юридические науки');

INSERT INTO Дисциплина (ID_направления_подготовки, Название_дисциплины, 
						Номер_семестра, Часы_практики, Часы_лабораторных, 
						Часы_лекций, Количество_зачётных_единиц)
VALUES
    (1, 'Технологии программирования', 1, 20, 30, 60, 5),
    (1, 'Базы данных', 2, 10, 20, 40, 4),
    (2, 'Философия', 3, 15, 10, 30, 3),
    (2, 'Вычислительные машины', 4, 30, 15, 45, 6),
    (3, 'Математика', 5, 5, 25, 35, 3);

INSERT INTO Группа (Название_группы, ID_куратора, Номер_курса, ID_направления_подготовки)
VALUES
    ('БПМ-22-1', 1, 2, 1),
	('БПМ-22-2', 1, 2, 1),
	('БПМ-23-1', 1, 1, 1),
	('БПМ-23-2', 1, 1, 1),
    ('БИВТ-22-1', 2, 2, 1),
	('БИВТ-22-2', 2, 2, 1),
	('БИВТ-20-1', 2, 4, 1),
	('БИВТ-21-1', 4, 3, 1),
    ('БЛГ-22-1', 4, 2, 2);

INSERT INTO Расписание_занятий (ID_преподавателя, ID_пары, ID_дисциплины, ID_группы, Номер_аудитории)
VALUES
    (1, 1, 1, 1, 'Б-4'),
    (2, 2, 2, 1, 'Л-613'),
    (3, 3, 3, 1, 'А-304'),
    (4, 4, 4, 2, 'Б-734'),
    (4, 5, 4, 2, 'Г-112'),
    (3, 6, 3, 2, 'К-507'),
    (2, 7, 2, 1, 'А-201'),
    (1, 8, 1, 1, 'Л-409'),
    (4, 10, 4, 1, 'Б-512'),
    (1, 11, 1, 1, 'Л-205'),
    (3, 12, 3, 2, 'А-402'),
    (2, 13, 2, 1, 'Б-623'),
    (1, 14, 1, 1, 'А-101'),
    (2, 15, 2, 1, 'Б-202'),
    (3, 16, 3, 3, 'Г-303'),
    (4, 17, 4, 3, 'Л-404'),
    (4, 18, 4, 3, 'К-505'),
    (1, 19, 1, 1, 'А-606'),
    (2, 20, 2, 1, 'Б-707'),
    (3, 21, 3, 5, 'Г-808'),
    (4, 22, 4, 5, 'Л-909'),
    (4, 23, 4, 1, 'К-101'),
    (1, 24, 1, 1, 'А-202'),
    (2, 25, 2, 3, 'Б-303'),
    (3, 26, 3, 1, 'Г-404'),
    (4, 27, 4, 1, 'Л-505'),
    (4, 28, 4, 6, 'К-606'),
    (1, 29, 1, 6, 'А-707'),
    (2, 30, 2, 6, 'Б-808'),
    (3, 31, 3, 9, 'Г-909'),
    (4, 32, 4, 1, 'Л-101'),
    (4, 33, 4, 1, 'К-202'),
    (1, 34, 1, 1, 'А-303'),
    (2, 35, 2, 7, 'Б-404'),
    (3, 36, 3, 6, 'Г-505'),
    (4, 37, 4, 6, 'Л-606'),
    (4, 38, 4, 1, 'К-707'),
    (1, 39, 1, 1, 'А-808'),
    (2, 40, 2, 1, 'Б-909'),
    (3, 41, 3, 1, 'А-101'),
    (4, 42, 4, 1, 'Б-202'),
    (4, 43, 4, 3, 'Г-303'),
    (1, 44, 1, 3, 'Л-404'),
    (2, 45, 2, 3, 'К-505'),
    (3, 46, 3, 6, 'А-606'),
    (4, 47, 4, 8, 'Б-707'),
    (4, 48, 4, 8, 'Г-808'),
    (1, 49, 1, 1, 'Л-909'),
    (2, 50, 2, 1, 'К-101');

INSERT INTO Студент (Имя, Фамилия, Отчество, ID_группы,
					 Дата_рождения, Электронная_почта, ID_научного_руководителя)
VALUES
    ('Мария', 'Игнатова', 'Алексеевна', 1, '1999-09-22', 'maria@example.com', 2),
    ('Павел', 'Николаев', 'Сергеевич', 2, '2001-04-30', 'pavel@example.com', 3),
    ('Екатерина', 'Белова', 'Дмитриевна', 3, '1997-12-18', 'ekaterina@example.com', 4),
    ('Артем', 'Мельников', 'Владимирович', 4, '1998-06-11', 'artem@example.com', 1),
	('Иван', 'Петров', 'Александрович', 1, '1999-02-15', 'ivan@example.com', 4),
    ('Наталья', 'Сидорова', 'Васильевна', 1, '2000-11-03', 'natalia@example.com', 4),
    ('Денис', 'Кузнецов', 'Игоревич', 1, '1997-08-27', 'denis@example.com', 4),
    ('Александра', 'Федорова', 'Андреевна', 1, '2001-07-09', 'alexandra@example.com', 3),
    ('Максим', 'Иванов', 'Дмитриевич', 1, '1998-03-18', 'maxim@example.com', 3),
    ('Анна', 'Козлова', 'Игоревна', 1, '1999-05-21', 'anna@example.com', 2),
    ('Сергей', 'Титов', 'Сергеевич', 1, '2000-09-30', 'sergey@example.com', 1),
    ('Ольга', 'Макарова', 'Олеговна', 1, '1998-12-14', 'olga@example.com', 2),
    ('Дмитрий', 'Капустин', 'Павлович', 1, '2001-01-25', 'dmitriy@example.com', 1),
    ('Елена', 'Соловьева', 'Игоревна', 1, '1999-06-05', 'elena@example.com', 4),
    ('Артем', 'Воронцов', 'Андреевич', 1, '2000-08-17', 'artem@example.com', 4),
    ('Кристина', 'Исаева', 'Петровна', 1, '1997-04-12', 'kristina@example.com', 1),
    ('Роман', 'Кудрявцев', 'Алексеевич', 1, '2001-10-28', 'roman@example.com', 1),
    ('Юлия', 'Смирнова', 'Сергеевна', 1, '1998-07-02', 'yulia@example.com', 1),
    ('Владислав', 'Белкин', 'Васильевич', 1, '1999-11-14', 'vladislav@example.com', 1),
    ('Анастасия', 'Полякова', 'Игоревна', 1, '2000-02-19', 'anastasia@example.com', 2),
    ('Игорь', 'Родин', 'Дмитриевич', 1, '1997-09-23', 'igor@example.com', 2),
    ('Марина', 'Сергеева', 'Александровна', 1, '2001-12-31', 'marina@example.com', 2),
    ('Артемий', 'Куликов', 'Петрович', 1, '1998-06-17', 'artemiy@example.com', 3),
    ('Елена', 'Андреева', 'Владимировна', 1, '1999-03-22', 'elena@example.com', 4);

